; domain
(define (domain TOWER-OF-HANOI)
    (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions)
    (:types disk tower)
 
    (:predicates (topoftower ?x - disk ?y - tower)
                 (ondisk ?x - disk ?y - disk ?z - tower)
                 (issmaller ?x - disk ?y - disk)
                 (handempty)
                 (holding ?x - disk)
                 (emptytower ?x - tower)
          (bottomoftower ?x - disk ?y - tower)
                 )
 
    (:action pick-up-1
          :parameters (?x - disk ?y - tower)
          :precondition
         (and (topoftower ?x ?y)
              (handempty)
              (bottomoftower ?x ?y))
          :effect
          (and (not (topoftower ?x ?y))
             (not (handempty))
             (holding ?x)
             (not (bottomoftower ?x ?y))
             (emptytower ?y))
    )
 
    (:action pick-up-from-stack-2
         :parameters (?x - disk ?y - disk ?z - tower)
          :precondition
         (and (topoftower ?x ?z)
              (handempty)
              (ondisk ?x ?y ?z))
          :effect
          (and (not (topoftower ?x ?z))
               (topoftower ?y ?z)
               (not (ondisk ?x ?y ?z))
               (not (handempty))
               (holding ?x))
    )
 
    (:action place-on-tower-3
         :parameters (?x - disk ?y - tower)
         :precondition
         (and (holding ?x)
              (emptytower ?y))
         :effect
         (and (not (holding ?x))
             (topoftower ?x ?y)
             (handempty)
             (not (emptytower ?y))
             (bottomoftower ?x ?y))
    )
 
    (:action place-on-stack-4
         :parameters (?x - disk ?y - disk ?z - tower)
         :precondition
         (and (holding ?x)
              (topoftower ?y ?z)
              (issmaller ?x ?y))
         :effect
         (and (not (holding ?x))
             (not (topoftower ?y ?z))
             (ondisk ?x ?y ?z)
             (handempty)
             (topoftower ?x ?z))
    )
    
)

; problem
(define (problem PROBLEM-OF-HANOI-3)
(:domain TOWER-OF-HANOI)
(:objects A B C - disk T1 T2 T3 - tower)
(:INIT (HANDEMPTY)
       (ISSMALLER A B) (ISSMALLER A C) (ISSMALLER B C)
       (TOPOFTOWER A T1)
       (BOTTOMOFTOWER C T1)
       (ONDISK A B T1) (ONDISK B C T1)
       (EMPTYTOWER T2) (EMPTYTOWER T3)
       )
(:goal (AND (ONDISK A B T3) (ONDISK B C T3)))
)

; plan
1. (pick-up-from-stack-2 a b t1)
   deleted: (topoftower a t1) (ondisk a b t1) (handempty)
   added: (topoftower b t1) (holding a)
   goals met: 0 of 2
2. (place-on-tower-3 a t3)
   deleted: (holding a) (emptytower t3)
   added: (topoftower a t3) (handempty) (bottomoftower a t3)
   goals met: 0 of 2
3. (pick-up-from-stack-2 b c t1)
   deleted: (topoftower b t1) (ondisk b c t1) (handempty)
   added: (topoftower c t1) (holding b)
   goals met: 0 of 2
4. (place-on-tower-3 b t2)
   deleted: (holding b) (emptytower t2)
   added: (topoftower b t2) (handempty) (bottomoftower b t2)
   goals met: 0 of 2
5. (pick-up-1 a t3)
   deleted: (topoftower a t3) (handempty) (bottomoftower a t3)
   added: (holding a) (emptytower t3)
   goals met: 0 of 2
6. (place-on-stack-4 a b t2)
   deleted: (holding a) (topoftower b t2)
   added: (ondisk a b t2) (handempty) (topoftower a t2)
   goals met: 0 of 2
7. (pick-up-1 c t1)
   deleted: (topoftower c t1) (handempty) (bottomoftower c t1)
   added: (holding c) (emptytower t1)
   goals met: 0 of 2
8. (place-on-tower-3 c t3)
   deleted: (holding c) (emptytower t3)
   added: (topoftower c t3) (handempty) (bottomoftower c t3)
   goals met: 0 of 2
9. (pick-up-from-stack-2 a b t2)
   deleted: (topoftower a t2) (ondisk a b t2) (handempty)
   added: (topoftower b t2) (holding a)
   goals met: 0 of 2
10. (place-on-tower-3 a t1)
   deleted: (holding a) (emptytower t1)
   added: (topoftower a t1) (handempty) (bottomoftower a t1)
   goals met: 0 of 2
11. (pick-up-1 b t2)
   deleted: (topoftower b t2) (handempty) (bottomoftower b t2)
   added: (holding b) (emptytower t2)
   goals met: 0 of 2
12. (place-on-stack-4 b c t3)
   deleted: (holding b) (topoftower c t3)
   added: (ondisk b c t3) (handempty) (topoftower b t3)
   goals met: 1 of 2
13. (pick-up-1 a t1)
   deleted: (topoftower a t1) (handempty) (bottomoftower a t1)
   added: (holding a) (emptytower t1)
   goals met: 1 of 2
14. (place-on-stack-4 a b t3)
   deleted: (holding a) (topoftower b t3)
   added: (ondisk a b t3) (handempty) (topoftower a t3)
   goals met: 2 of 2
